In [2]:
import pandas as pd
import numpy as np

In [3]:
dict1={
    "Nombre":["Ringo","John","Paul","George","Yoko"],
    "Edad":[45,34,42,38,47],
    "Salario":[12000,14000,13000,11000,10000],
    "Genero":["M","M","M","M","F"]
}

In [4]:
data=pd.DataFrame(dict1)

In [5]:
data.head()

   Nombre  Edad  Salario Genero
0   Ringo    45    12000      M
1    John    34    14000      M
2    Paul    42    13000      M
3  George    38    11000      M
4    Yoko    47    10000      F

In [6]:
datos_categoricos=data.select_dtypes(exclude=[np.number]) #Excluír data numérica y seleccionar el resto
print("La base contiene {0} datos categóricos".format(datos_categoricos.shape[1]))

La base contiene 2 datos categóricos

In [7]:
datos_categoricos

   Nombre Genero
0   Ringo      M
1    John      M
2    Paul      M
3  George      M
4    Yoko      F

In [8]:
datos_categoricos.shape

(5, 2)

In [9]:
datos_categoricos.shape[1]

2

In [10]:
data.dtypes

Nombre     object
Edad        int64
Salario     int64
Genero     object
dtype: object

In [11]:
data.describe()

            Edad      Salario
count   5.000000      5.00000
mean   41.200000  12000.00000
std     5.263079   1581.13883
min    34.000000  10000.00000
25%    38.000000  11000.00000
50%    42.000000  12000.00000
75%    45.000000  13000.00000
max    47.000000  14000.00000

In [12]:
data.median(numeric_only=True)

Edad          42.0
Salario    12000.0
dtype: float64

In [13]:
data.count()

Nombre     5
Edad       5
Salario    5
Genero     5
dtype: int64

In [14]:
data.mean(numeric_only=True)

Edad          41.2
Salario    12000.0
dtype: float64

In [15]:
data.mode(numeric_only=True)

   Edad  Salario
0    34    10000
1    38    11000
2    42    12000
3    45    13000
4    47    14000

In [16]:
data.std(numeric_only=True)

Edad          5.263079
Salario    1581.138830
dtype: float64

In [17]:
data.sum()

Nombre     RingoJohnPaulGeorgeYoko
Edad                           206
Salario                      60000
Genero                       MMMMF
dtype: object

In [18]:
data.max()

Nombre      Yoko
Edad          47
Salario    14000
Genero         M
dtype: object

In [19]:
data.min()

Nombre     George
Edad           34
Salario     10000
Genero          F
dtype: object

In [20]:
data[data["Edad"]==data["Edad"].min()]

  Nombre  Edad  Salario Genero
1   John    34    14000      M

In [21]:
data["Edad"].abs

<bound method NDFrame.abs of 0    45
1    34
2    42
3    38
4    47
Name: Edad, dtype: int64>

In [22]:
data.prod(numeric_only=True)

Edad                114768360
Salario    432327041775828992
dtype: int64

In [23]:
data.cumsum()

                    Nombre  Edad  Salario Genero
0                    Ringo    45    12000      M
1                RingoJohn    79    26000     MM
2            RingoJohnPaul   121    39000    MMM
3      RingoJohnPaulGeorge   159    50000   MMMM
4  RingoJohnPaulGeorgeYoko   206    60000  MMMMF

In [24]:
data["Edad"].cumprod()

0           45
1         1530
2        64260
3      2441880
4    114768360
Name: Edad, dtype: int64

In [25]:
data

   Nombre  Edad  Salario Genero
0   Ringo    45    12000      M
1    John    34    14000      M
2    Paul    42    13000      M
3  George    38    11000      M
4    Yoko    47    10000      F

In [26]:
data2=pd.get_dummies(data[["Genero"]])

In [27]:
data2

   Genero_F  Genero_M
0         0         1
1         0         1
2         0         1
3         0         1
4         1         0

In [28]:
pd.get_dummies(data["Genero"])

   F  M
0  0  1
1  0  1
2  0  1
3  0  1
4  1  0

In [29]:
data2.value_counts()

Genero_F  Genero_M
0         1           4
1         0           1
dtype: int64

# Ejercicio Básico

In [34]:
max=data["Salario"].max()
min=data["Salario"].min()
print("La diferencia entre el salario más alto ({0}) y el mas bajo ({1}) es: {2}".format(max,min,max-min))

La diferencia entre el salario más alto (14000) y el mas bajo (10000) es: 4000

# Ejercicio Avanzado

In [36]:
data["Salario"].describe()

count        5.00000
mean     12000.00000
std       1581.13883
min      10000.00000
25%      11000.00000
50%      12000.00000
75%      13000.00000
max      14000.00000
Name: Salario, dtype: float64